# Chapter 3

## Episode 1

In [ ]:
account_balance = 500

In [ ]:
# 3.1.A.

def get_balance():
    print(f'Your balance is ${account_balance}')

In [ ]:
# 3.1.B.

get_balance()

In [ ]:
def get_balance(account_number):
    print(f'Account: {account_number} | Balance: $500')

In [ ]:
# 3.1.C.

get_balance('7779311')

In [ ]:
# 3.1.D.
# 3.1.E.

def withdraw_funds(account_number, withdrawal_amount):
    
    approve_transaction = False
    
    if(withdrawal_amount) <= account_balance:
        approve_transaction = True
        
    return approve_transaction

In [ ]:
# 3.1.C.

withdraw_funds('7779311', 400)

In [ ]:
# 3.1.E.

def deposit_funds(deposit_amount):
    
    new_balance = deposit_amount + account_balance
    
    return(new_balance)

In [ ]:
# 3.1.C.

deposit_funds(200)

# What happened here?

In [ ]:
# 3.1.F.LIVE
'''
Write a function that deposits money into an account.
The function should accept the account number and the deposit amount.
It should return the account number and the new balance.
'''

# Break down the logic into steps!
# 1. Define the function
# 2. Set up the arguments
# 3. Code the function
# 4. Send back the result

def deposit_funds(deposit_amount):    
    new_balance = account_balance + deposit_amount
    return new_balance
    
deposit_funds(200)

In [ ]:
# 3.1.G
    
promo_interest_rate = .05

def add_interest(bal, rate):
    
    new_bal = bal + (bal*rate)
     
    return new_bal

add_interest(account_balance, promo_interest_rate)

In [ ]:
# 3.1.H

add_interest = lambda bal, rate : bal + (bal*rate)
# FUNCTION NAME        INPUT(S)   CALCULATION(S)

new_balance = add_interest(account_balance, promo_interest_rate)
new_balance

In [ ]:
# 3.1.I.LIVE

deposit_funds = lambda deposit_amount : account_balance + deposit_amount

deposit_funds(250)

In [ ]:
account_balances = [500, 600, 12000, 10000, 700.50, 11000.50]
promo_interest_rate = .1 

def add_interest(accts, rate):
    new_balances = []
    
    for acct in accts:
        acct = acct + (acct*rate)
        new_balances.append(acct)
     
    return new_balances

add_interest(account_balances, promo_interest_rate)

## Episode 2

In [ ]:
my_arr = [1,2,3,4,6]
my_arr

for x in my_arr:
    print(x)

In [ ]:
import pandas as pd

foo = pd.Series(my_arr)
foo

In [ ]:
# 3.2.A

import pandas as pd

In [ ]:
# 3.2.B

accounts_df = pd.read_csv('chp3_account_balances.csv')
accounts_df

In [ ]:
# 3.2.C

accounts_df.head()

In [ ]:
# 3.2.D

accounts_df.tail()

In [ ]:
# 3.2.E

accounts_df.head(2)

In [ ]:
# 3.2.F

accounts_df.columns

In [ ]:
accounts_df.describe()

In [ ]:
# 3.2.G

accounts_df.sort_values(by='Balance')

In [ ]:
# 3.2.H

accounts_df.sort_values(by='Balance', ascending=False)

In [ ]:
# 3.2.I.LIVE

import pandas as pd

accounts_df = pd.read_csv('chp3_account_balances.csv')

accounts_df.sort_values(by='First Name')

In [ ]:
# 3.2.J.LIVE

import pandas as pd

accounts_df = pd.read_csv('chp3_account_balances.csv')

accounts_df.sort_values(by=['Last Name','First Name'])

In [ ]:
# creating a series from a list
account_balances = [500, 3463.68, 12299.10, 10199.21, 700, 13009.02]

bal_series = pd.Series(account_balances)

bal_series

In [ ]:
# accessing values within a Series

print(bal_series[2]) # index 2: 12299.10
print(bal_series[0]) # index 0: 500
print(bal_series[4]) # index 4: 700

In [ ]:
# 3.2.K

accounts = [{'acct_no': '7779311', 'full_name': 'Sabrina Spellman', 'acct_bal': 19000},
           {'acct_no': '7789422', 'full_name': 'Ambrose Spellman', 'acct_bal': 21000},
           {'acct_no': '7829366', 'full_name': 'Hilda Spellman', 'acct_bal': 25000},
           {'acct_no': '7839477', 'full_name': 'Zelda Spellman', 'acct_bal': 32000}]

acct_df = pd.DataFrame(accounts)
acct_df

In [ ]:
# 3.2.L

acct_dict = {
    'acct_no': ['7779311','7789422','7829366','7839477'],
    'full_name': ['Sabrina Spellman','Ambrose Spellman','Hilda Spellman','Zelda Spellman'],
    'acct_bal': [19000,21000,25000,32000]
}

acct_df = pd.DataFrame(acct_dict)
acct_df

In [ ]:
# 3.2.M

# placeholder for scenarios and handling errors

In [ ]:
# 3.2.O

acct_df['full_name']

In [ ]:
# 3.2.P

# pick only one column and assign to a variable
clients = acct_df['full_name']
clients

In [ ]:
# 3.2.Q

# convert a series to a list
print(type(clients))
client_list = list(clients)
print(type(client_list))
client_list

In [ ]:
# 3.2.R

# select more than one column: passing in a list of column names
client_bal = acct_df[['full_name','acct_bal']]

# note that this returns a DataFrame
client_bal

In [ ]:
# 3.2.S

# Statistical summary
client_bal.describe()

In [ ]:
# 3.2.T

# record count
print('# of accounts')
print(client_bal['acct_bal'].count())

print('Lowest account balance')
# min
print(client_bal['acct_bal'].min())

# max
print('Highest account balance')
print(client_bal['acct_bal'].max())

# mean
print('Average account balance')
print(client_bal['acct_bal'].mean())

# sum
print('Total account balances')
print(client_bal['acct_bal'].sum())

In [ ]:
client_bal

In [ ]:
# 3.2.U.LIVE.1

acct_num_name = acct_df[['acct_no', 'full_name']]
acct_num_name.sort_values('full_name')

In [ ]:
# 3.2.U.LIVE.2

acct_df['acct_bal'].sum()

In [ ]:
# 3.2.U.LIVE.3

acct_bals = acct_df['acct_bal']
acct_bal_list = list(acct_bals)
sum_bal = 0

for bal in acct_bal_list:
    sum_bal += bal
    
sum_bal

In [ ]:
# 3.2.U.LIVE.4

print(f'The sum of all account balances is {sum_bal}')

In [ ]:
acct_dict = {
    'acct_no': ['7779311','7789422','7829366','7839477'],
    'full_name': ['Sabrina Spellman','Ambrose Spellman','Hilda Spellman','Zelda Spellman'],
    'acct_bal': [19000,21000,25000,32000]
}

acct_df = pd.DataFrame(acct_dict)
acct_df

## Episode 3

In [192]:
# 3.3.A

# DICTIONARY OF LISTS
acct_dict = {
    'acct_no': ['7779311','7789422','7829366','7839477'],
    'first_name': ['Sabrina','Ambrose','Hilda','Zelda'],
    'last_name': ['Spellman','Spellman','Spellman','Spellman'],
    'acct_bal': [19000,21000,25000,32000]
}

# LIST OF DICTIONARIES
# accounts = [{'acct_no': '7779311', 'full_name': 'Sabrina Spellman', 'acct_bal': 19000},
#            {'acct_no': '7789422', 'full_name': 'Ambrose Spellman', 'acct_bal': 21000},
#            {'acct_no': '7829366', 'full_name': 'Hilda Spellman', 'acct_bal': 25000},
#            {'acct_no': '7839477', 'full_name': 'Zelda Spellman', 'acct_bal': 32000}]

acct_df = pd.DataFrame(acct_dict)
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [193]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [194]:
# 3.3.B

#iloc to find records
#iloc[ ] uses the *numeric* indexes of a dataframe's rows and columns to return specific values

#row 1
acct_df.iloc[0]

acct_no        7779311
first_name     Sabrina
last_name     Spellman
acct_bal         19000
Name: 0, dtype: object

In [195]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [196]:
# 3.3.C

#row 2, column 2
acct_df.iloc[1,1]

'Ambrose'

In [197]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [198]:
# 3.3.D

#row 2, all columns
acct_df.iloc[1,:]

#row index is the default parameter

acct_no        7789422
first_name     Ambrose
last_name     Spellman
acct_bal         21000
Name: 1, dtype: object

In [199]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [200]:
# 3.3.E

#all rows, column 3
acct_df.iloc[:,2]

0    Spellman
1    Spellman
2    Spellman
3    Spellman
Name: last_name, dtype: object

In [201]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [202]:
# 3.3.F

#all rows, columns 1 and 2 (up to, but not including 3)
acct_df.iloc[:,1:3]

  first_name last_name
0    Sabrina  Spellman
1    Ambrose  Spellman
2      Hilda  Spellman
3      Zelda  Spellman

In [203]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [204]:
# 3.3.G.LIVE.1
acct_df.iloc[1]

acct_no        7789422
first_name     Ambrose
last_name     Spellman
acct_bal         21000
Name: 1, dtype: object

In [205]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [206]:
# 3.3.G.LIVE.2

#rows 2 - 4
#columns 2 and 3 (up to, but not including ix 3)

acct_df.iloc[1:4,1:3]

  first_name last_name
1    Ambrose  Spellman
2      Hilda  Spellman
3      Zelda  Spellman

In [207]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [208]:
# 3.3.G.LIVE.3

#rows 2 and 3, all columns
acct_df.iloc[1:3]

   acct_no first_name last_name  acct_bal
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000

In [209]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [210]:
# 3.3.G.LIVE.4

#rows 2 through 4, all columns
acct_df.iloc[1:4]

   acct_no first_name last_name  acct_bal
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [211]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [212]:
# 3.3.H

In [213]:
acct_df

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [214]:
# find records with last name Spellman
acct_df.loc[acct_df['last_name'] == 'Spellman']

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000
2  7829366      Hilda  Spellman     25000
3  7839477      Zelda  Spellman     32000

In [215]:
faustus_dict = {'acct_no': '7779999', 'first_name': 'Faustus', 'last_name':'Blackwood', 'acct_bal': 29000}

faustus_dict

{'acct_no': '7779999',
 'first_name': 'Faustus',
 'last_name': 'Blackwood',
 'acct_bal': 29000}

In [216]:
acct_df = acct_df.append(faustus_dict, ignore_index=True)
acct_df

C:\Users\Student\AppData\Local\Temp\ipykernel_3252\1697377352.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  acct_df = acct_df.append(faustus_dict, ignore_index=True)

   acct_no first_name  last_name  acct_bal
0  7779311    Sabrina   Spellman     19000
1  7789422    Ambrose   Spellman     21000
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [217]:
acct_df.loc[acct_df['last_name'] == 'Blackwood']

   acct_no first_name  last_name  acct_bal
4  7779999    Faustus  Blackwood     29000

In [218]:
acct_df

   acct_no first_name  last_name  acct_bal
0  7779311    Sabrina   Spellman     19000
1  7789422    Ambrose   Spellman     21000
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [219]:
acct_df['acct_bal'] >= 25000

0    False
1    False
2     True
3     True
4     True
Name: acct_bal, dtype: bool

In [220]:
# 3.3.I

# find value by numeric condition
acct_df.loc[acct_df['acct_bal'] >= 25000]

   acct_no first_name  last_name  acct_bal
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [221]:
acct_df

   acct_no first_name  last_name  acct_bal
0  7779311    Sabrina   Spellman     19000
1  7789422    Ambrose   Spellman     21000
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [222]:
acct_df['first_name'].str.contains('Amb')

0    False
1     True
2    False
3    False
4    False
Name: first_name, dtype: bool

In [223]:
acct_df

   acct_no first_name  last_name  acct_bal
0  7779311    Sabrina   Spellman     19000
1  7789422    Ambrose   Spellman     21000
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [224]:
# 3.3.J

# find value by string wildcard
acct_df.loc[acct_df['first_name'].str.contains('Amb')]

   acct_no first_name last_name  acct_bal
1  7789422    Ambrose  Spellman     21000

In [225]:
acct_df

   acct_no first_name  last_name  acct_bal
0  7779311    Sabrina   Spellman     19000
1  7789422    Ambrose   Spellman     21000
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [232]:
# 3.3.K

# find value by string wildcard case insensitive
acct_df.loc[acct_df['first_name'].str.contains('amb', case=False)]

   acct_no first_name last_name  acct_bal
1  7789422    Ambrose  Spellman     21000

In [233]:
acct_df

   acct_no first_name  last_name  acct_bal
0  7779311    Sabrina   Spellman     19000
1  7789422    Ambrose   Spellman     21000
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [237]:
# 3.3.L.LIVE.1

# PRACTICE
# 1. Use loc to find the records that have less than 25000

acct_df.loc[acct_df['acct_bal'] < 25000]

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000

In [238]:
acct_df

   acct_no first_name  last_name  acct_bal
0  7779311    Sabrina   Spellman     19000
1  7789422    Ambrose   Spellman     21000
2  7829366      Hilda   Spellman     25000
3  7839477      Zelda   Spellman     32000
4  7779999    Faustus  Blackwood     29000

In [240]:
# 3.3.L.LIVE.2

# 2. Use iloc to manually find those records
acct_df.iloc[0:2,:]

   acct_no first_name last_name  acct_bal
0  7779311    Sabrina  Spellman     19000
1  7789422    Ambrose  Spellman     21000

In [241]:
acct_df = pd.read_csv('chp3_account_balances.csv')
acct_df.head()

,Account Number,Last Name,First Name,Gender,Account Tier,Balance,Overdraft Protection
0,7799533,Kinkle,Harvey,M,Gold,75,0
1,7809344,Scratch,Nicolas,M,Classic,500,0
2,7819355,Putnam,Theo,M,Classic,90,1
3,7779311,Spellman,Sabrina,F,Platinum,800,1
4,7789422,Spellman,Ambrose,M,Platinum,1100,0

In [242]:
# 3.3.M

# Group
acct_grp_df = acct_df.groupby('Account Tier')
acct_grp_df

In [243]:
# 3.3.N

acct_grp_df.head()

,Account Number,Last Name,First Name,Gender,Account Tier,Balance,Overdraft Protection
0,7799533,Kinkle,Harvey,M,Gold,75,0
1,7809344,Scratch,Nicolas,M,Classic,500,0
2,7819355,Putnam,Theo,M,Classic,90,1
3,7779311,Spellman,Sabrina,F,Platinum,800,1
4,7789422,Spellman,Ambrose,M,Platinum,1100,0
5,7829366,Spellman,Hilda,F,Classic,400,1
6,7839477,Spellman,Zelda,F,Gold,500,1
7,7855044,Walker,Rosalind,F,Gold,500,1
8,7846033,Blackwood,Faustus,M,Platinum,1200,0
9,7855511,Gray,Dorian,M,Classic,350,0
10,7855522,Blackwood,Prudence,F,Platinum,900,1
11,7869844,Night,Dorcas,F,Gold,550,0
12,7969366,Night,Agatha,F,Gold,650,1

In [245]:
# 3.3.O

acct_grp_df.count()

,Account Number,Last Name,First Name,Gender,Balance,Overdraft Protection
Account Tier,,,,,,
Classic,4,4,4,4,4,4
Gold,5,5,5,5,5,5
Platinum,4,4,4,4,4,4

In [246]:
# 3.3.P

acct_grp_df['Account Number'].count()

Account Tier
Classic     4
Gold        5
Platinum    4
Name: Account Number, dtype: int64

In [248]:
acct_df

,Account Number,Last Name,First Name,Gender,Account Tier,Balance,Overdraft Protection
0,7799533,Kinkle,Harvey,M,Gold,75,0
1,7809344,Scratch,Nicolas,M,Classic,500,0
2,7819355,Putnam,Theo,M,Classic,90,1
3,7779311,Spellman,Sabrina,F,Platinum,800,1
4,7789422,Spellman,Ambrose,M,Platinum,1100,0
5,7829366,Spellman,Hilda,F,Classic,400,1
6,7839477,Spellman,Zelda,F,Gold,500,1
7,7855044,Walker,Rosalind,F,Gold,500,1
8,7846033,Blackwood,Faustus,M,Platinum,1200,0
9,7855511,Gray,Dorian,M,Classic,350,0
10,7855522,Blackwood,Prudence,F,Platinum,900,1
11,7869844,Night,Dorcas,F,Gold,550,0
12,7969366,Night,Agatha,F,Gold,650,1

In [247]:
# 3.3.Q

# min function
print('Lowest balances by account tier')
print(acct_grp_df['Balance'].min())
print('')

Lowest balances by account tier
Account Tier
Classic      90
Gold         75
Platinum    800
Name: Balance, dtype: int64

In [249]:
# max function
print('Highest balances by account tier')
print(acct_grp_df['Balance'].max())
print('')

Highest balances by account tier
Account Tier
Classic      500
Gold         650
Platinum    1200
Name: Balance, dtype: int64

In [250]:
# mean function
print('Average balances by account tier')
print(acct_grp_df['Balance'].mean())
print('')

Average balances by account tier
Account Tier
Classic      335.0
Gold         455.0
Platinum    1000.0
Name: Balance, dtype: float64

In [252]:
#3.3.R
acct_grp_df = acct_df.groupby(['Account Tier', 'Gender'])

In [253]:
#3.3.S
acct_grp_df['Account Number'].count()

Account Tier  Gender
Classic       F         1
              M         3
Gold          F         4
              M         1
Platinum      F         2
              M         2
Name: Account Number, dtype: int64

In [254]:
# 3.3.T

# min function
print('Lowest balances by account tier and gender')
print(acct_grp_df['Balance'].min())
print('')

Lowest balances by account tier and gender
Account Tier  Gender
Classic       F          400
              M           90
Gold          F          500
              M           75
Platinum      F          800
              M         1100
Name: Balance, dtype: int64

In [255]:
# max function
print('Highest balances by account tier and gender')
print(acct_grp_df['Balance'].max())
print('')

Highest balances by account tier and gender
Account Tier  Gender
Classic       F          400
              M          500
Gold          F          650
              M           75
Platinum      F          900
              M         1200
Name: Balance, dtype: int64

In [256]:
# mean function
print('Average balances by account tier and gender')
print(acct_grp_df['Balance'].mean())

Average balances by account tier and gender
Account Tier  Gender
Classic       F          400.000000
              M          313.333333
Gold          F          550.000000
              M           75.000000
Platinum      F          850.000000
              M         1150.000000
Name: Balance, dtype: float64

In [259]:
acct_grp_df['Balance'].max()

Account Tier  Gender
Classic       F          400
              M          500
Gold          F          650
              M           75
Platinum      F          900
              M         1200
Name: Balance, dtype: int64

In [258]:
acct_grp_df['Balance'].mean()

Account Tier  Gender
Classic       F          400.000000
              M          313.333333
Gold          F          550.000000
              M           75.000000
Platinum      F          850.000000
              M         1150.000000
Name: Balance, dtype: float64

In [261]:
pd.DataFrame(acct_grp_df['Balance'].mean())

                         Balance
Account Tier Gender
Classic      F        400.000000
             M        313.333333
Gold         F        550.000000
             M         75.000000
Platinum     F        850.000000
             M       1150.000000

In [262]:
acct_df

,Account Number,Last Name,First Name,Gender,Account Tier,Balance,Overdraft Protection
0,7799533,Kinkle,Harvey,M,Gold,75,0
1,7809344,Scratch,Nicolas,M,Classic,500,0
2,7819355,Putnam,Theo,M,Classic,90,1
3,7779311,Spellman,Sabrina,F,Platinum,800,1
4,7789422,Spellman,Ambrose,M,Platinum,1100,0
5,7829366,Spellman,Hilda,F,Classic,400,1
6,7839477,Spellman,Zelda,F,Gold,500,1
7,7855044,Walker,Rosalind,F,Gold,500,1
8,7846033,Blackwood,Faustus,M,Platinum,1200,0
9,7855511,Gray,Dorian,M,Classic,350,0
10,7855522,Blackwood,Prudence,F,Platinum,900,1
11,7869844,Night,Dorcas,F,Gold,550,0
12,7969366,Night,Agatha,F,Gold,650,1

In [263]:
# 3.3.U

# Define bins using a list of numeric ranges.
bal_bins = [0, 100, 1000, 2000]

In [264]:
# Set up labels that correspond with the ranges.
bal_labels = ['Low', 'Moderate', 'High']

In [265]:
acct_df['Balance']

0       75
1      500
2       90
3      800
4     1100
5      400
6      500
7      500
8     1200
9      350
10     900
11     550
12     650
Name: Balance, dtype: int64

In [266]:
# Use the pd.cut function to create bins.
bal_tier = pd.cut(acct_df['Balance'], bins=bal_bins, labels=bal_labels)
bal_tier

0          Low
1     Moderate
2          Low
3     Moderate
4         High
5     Moderate
6     Moderate
7     Moderate
8         High
9     Moderate
10    Moderate
11    Moderate
12    Moderate
Name: Balance, dtype: category
Categories (3, object): ['Low' < 'Moderate' < 'High']

In [267]:
acct_df

,Account Number,Last Name,First Name,Gender,Account Tier,Balance,Overdraft Protection
0,7799533,Kinkle,Harvey,M,Gold,75,0
1,7809344,Scratch,Nicolas,M,Classic,500,0
2,7819355,Putnam,Theo,M,Classic,90,1
3,7779311,Spellman,Sabrina,F,Platinum,800,1
4,7789422,Spellman,Ambrose,M,Platinum,1100,0
5,7829366,Spellman,Hilda,F,Classic,400,1
6,7839477,Spellman,Zelda,F,Gold,500,1
7,7855044,Walker,Rosalind,F,Gold,500,1
8,7846033,Blackwood,Faustus,M,Platinum,1200,0
9,7855511,Gray,Dorian,M,Classic,350,0
10,7855522,Blackwood,Prudence,F,Platinum,900,1
11,7869844,Night,Dorcas,F,Gold,550,0
12,7969366,Night,Agatha,F,Gold,650,1

In [270]:
bal_tier

0          Low
1     Moderate
2          Low
3     Moderate
4         High
5     Moderate
6     Moderate
7     Moderate
8         High
9     Moderate
10    Moderate
11    Moderate
12    Moderate
Name: Balance, dtype: category
Categories (3, object): ['Low' < 'Moderate' < 'High']

In [271]:
# Create a new column within your existing DataFrame to add the binning output.
acct_df['Balance Tier'] = bal_tier

acct_df

,Account Number,Last Name,First Name,Gender,Account Tier,Balance,Overdraft Protection,Balance Tier
0,7799533,Kinkle,Harvey,M,Gold,75,0,Low
1,7809344,Scratch,Nicolas,M,Classic,500,0,Moderate
2,7819355,Putnam,Theo,M,Classic,90,1,Low
3,7779311,Spellman,Sabrina,F,Platinum,800,1,Moderate
4,7789422,Spellman,Ambrose,M,Platinum,1100,0,High
5,7829366,Spellman,Hilda,F,Classic,400,1,Moderate
6,7839477,Spellman,Zelda,F,Gold,500,1,Moderate
7,7855044,Walker,Rosalind,F,Gold,500,1,Moderate
8,7846033,Blackwood,Faustus,M,Platinum,1200,0,High
9,7855511,Gray,Dorian,M,Classic,350,0,Moderate
10,7855522,Blackwood,Prudence,F,Platinum,900,1,Moderate
11,7869844,Night,Dorcas,F,Gold,550,0,Moderate
12,7969366,Night,Agatha,F,Gold,650,1,Moderate

In [272]:
tier_df = acct_df.groupby('Balance Tier')

In [274]:
tier_df['Balance'].count()

Balance Tier
Low         2
Moderate    9
High        2
Name: Balance, dtype: int64

In [275]:
acct_df

,Account Number,Last Name,First Name,Gender,Account Tier,Balance,Overdraft Protection,Balance Tier
0,7799533,Kinkle,Harvey,M,Gold,75,0,Low
1,7809344,Scratch,Nicolas,M,Classic,500,0,Moderate
2,7819355,Putnam,Theo,M,Classic,90,1,Low
3,7779311,Spellman,Sabrina,F,Platinum,800,1,Moderate
4,7789422,Spellman,Ambrose,M,Platinum,1100,0,High
5,7829366,Spellman,Hilda,F,Classic,400,1,Moderate
6,7839477,Spellman,Zelda,F,Gold,500,1,Moderate
7,7855044,Walker,Rosalind,F,Gold,500,1,Moderate
8,7846033,Blackwood,Faustus,M,Platinum,1200,0,High
9,7855511,Gray,Dorian,M,Classic,350,0,Moderate
10,7855522,Blackwood,Prudence,F,Platinum,900,1,Moderate
11,7869844,Night,Dorcas,F,Gold,550,0,Moderate
12,7969366,Night,Agatha,F,Gold,650,1,Moderate

In [295]:
# 3.3.V.LIVE

'''
1. Create bins where the tiers are:
    0 - 500: Low
    >500 - 2000: OK
2. Group the dataframe by Account Tier and Balance Tier
3. By account and balance tier, return the number of customers who have overdraft protection enabled
4. COnvert the output to a DataFrame
'''

bal_bins = [0, 500, 2000]
bal_labels = ['High risk', 'OK']

acct_bin = pd.cut(acct_df['Balance'], bins=bal_bins, labels=bal_labels)

#1. the series that you want to bin
#2. the bins and ranges
#3. the labels for the bins

In [296]:
acct_bin

0     High risk
1     High risk
2     High risk
3            OK
4            OK
5     High risk
6     High risk
7     High risk
8            OK
9     High risk
10           OK
11           OK
12           OK
Name: Balance, dtype: category
Categories (2, object): ['High risk' < 'OK']

In [ ]:
acct_df['Risk Level'] = acct_bin
acct_df

In [301]:
risk_grp = acct_df.groupby(['Risk Level','Overdraft Protection'])
risk_grp['Account Number'].count()

Risk Level  Overdraft Protection
High risk   0                       3
            1                       4
OK          0                       3
            1                       3
Name: Account Number, dtype: int64

In [302]:
risk_group_df = pd.DataFrame(risk_grp['Account Number'].count())
risk_group_df

                                 Account Number
Risk Level Overdraft Protection
High risk  0                                  3
           1                                  4
OK         0                                  3
           1                                  3

In [305]:
risk_group_df

                                 Account Number
Risk Level Overdraft Protection
High risk  0                                  3
           1                                  4
OK         0                                  3
           1                                  3

## Episode 4

In [ ]:
acct_df

In [306]:
# Looking up account number
record = acct_df.loc[(acct_df['Last Name'] == 'Spellman') & (acct_df['First Name'] == 'Sabrina')]
acct_number = record['Account Number']
acct_number

3    7779311
Name: Account Number, dtype: int64

In [307]:
# 3.4.A

# Looking up account number with variables
last_name = 'Spellman'
first_name = 'Sabrina'

record = acct_df.loc[(acct_df['Last Name'] == last_name) & (acct_df['First Name'] == first_name)]
acct_number = record['Account Number']
acct_number

3    7779311
Name: Account Number, dtype: int64

In [308]:
# 3.4.B

# Looking up account number with input
last_name = input('Last name: ')
first_name = input('First name: ')

record = acct_df.loc[(acct_df['Last Name'] == last_name) & (acct_df['First Name'] == first_name)]
acct_number = record['Account Number']
acct_number

Last name:
First name:

Series([], Name: Account Number, dtype: int64)

In [ ]:
# 3.4.C

# Looking up account number with input and exception handling
last_name = input('Last name: ')
first_name = input('First name: ')

record = acct_df.loc[(acct_df['Last Name'] == last_name) & (acct_df['First Name'] == first_name)]
acct_number = record['Account Number']

if acct_number.size == 0:
    print('Account not found')
elif acct_number.size > 1:
    print('Multiple account found')
else:
    print(acct_number)

In [ ]:
# 3.4.D

# Create a get_account() function
last_name = input('Last name: ')
first_name = input('First name: ')

def get_account(last_name, first_name):
    record = acct_df.loc[(acct_df['Last Name'] == last_name) & (acct_df['First Name'] == first_name)]
    acct_number = record['Account Number']
    
    if acct_number.size == 1:
        return acct_number.iat[0]
    else:
        return None
    
get_account(last_name, first_name)

In [ ]:
# 3.4.E

get_account('Blackwood', 'Faustus')

In [ ]:
# 3.4.F

last_name = input('Last name: ')
first_name = input('First name: ')

get_account(last_name, first_name)

In [ ]:
# 3.4.G

# Making a deposit by account number
deposit_amount = 200
acct_num = get_account('Spellman', 'Sabrina')

acct_rec = acct_df.loc[acct_df['Account Number'] == acct_num]
acct_rec['Balance'] = acct_rec['Balance'] + deposit_amount

acct_rec

In [ ]:
# 3.4.H

# work around copying the dataframe
row_index = acct_df.loc[acct_df['Account Number'] == acct_num].index
col_index = acct_df.columns.get_loc('Balance')

acct_df.iloc[row_index,col_index] = acct_df.iloc[row_index,col_index] + deposit_amount
acct_df

In [ ]:
# 3.4.I

# Create a deposit function
def make_deposit(acct_num, dep_amt):
          
    acct_rec = acct_df.loc[acct_df['Account Number'] == acct_num]
    row_index = acct_df.loc[acct_df['Account Number'] == acct_num].index
    col_index = acct_df.columns.get_loc('Balance')

    acct_df.iloc[row_index,col_index] = acct_df.iloc[row_index,col_index] + dep_amt

In [ ]:
# 3.4.J.LIVE

make_deposit(7855522, 250)
acct_df
#acct_df.loc[acct_df['Account Number'] == 7855522]

In [ ]:
# 3.4.K.LIVE

# Create a deposit function that returns the old balance, new balance and account holder name
def make_deposit(acct_num, dep_amt):
          
    # implement exception handling
        
    acct_rec = acct_df.loc[acct_df['Account Number'] == acct_num]
    idx_row = acct_df.loc[acct_df['Account Number'] == acct_num].index
    idx_bal = acct_df.columns.get_loc('Balance')
    idx_last_name = acct_df.columns.get_loc('Last Name')
    idx_first_name = acct_df.columns.get_loc('First Name')

    
    last_name = acct_df.iloc[idx_row,idx_last_name].iat[0]
    first_name = acct_df.iloc[idx_row,idx_first_name].iat[0]
    full_name = first_name + ' ' + last_name
    prev_balance = acct_df.iloc[idx_row,idx_bal].iat[0]
    new_balance = prev_balance + dep_amt

    acct_df.iloc[idx_row,idx_bal] = new_balance                   
                   
        
    print(f'''
          Account number: {acct_num}
          Full name: {full_name}
          Previous balance: {prev_balance}
          New balance: {new_balance}''')
    
    return

make_deposit(7855522, 250)

In [ ]:
# 3.4.L.LIVE

#Create a withdrawal function

def make_withdrawal(acct_num, wdw_amt):
          
    acct_rec = acct_df.loc[acct_df['Account Number'] == acct_num]
    row_index = acct_df.loc[acct_df['Account Number'] == acct_num].index
    col_index = acct_df.columns.get_loc('Balance')
    od_col_index = acct_df.columns.get_loc('Overdraft Protection')
    
    bal = acct_df.iloc[row_index,col_index].iat[0]
    
    if (bal - wdw_amt) >= 0:
        acct_df.iloc[row_index,col_index] = acct_df.iloc[row_index,col_index] - wdw_amt
    elif acct_df.iloc[row_index,od_col_index].iat[0] == 1:
        acct_df.iloc[row_index,col_index] = acct_df.iloc[row_index,col_index] - wdw_amt
    else:
        print('Insuffient funds')

In [ ]:
# 3.4.M.LIVE

make_withdrawal(7869844, 500)
acct_df

In [ ]:
make_withdrawal(7969366, 600)
acct_df